#include <iostream>
#include <time.h>

using namespace std;
//---------------------Функции и Прототипы---------------------------------------





//------------------------MAIN----------------------------------------------------
int main() {
	setlocale(LC_ALL, "RU");
	srand(time(NULL));
	//-------------------------------САМА ПРОГА-------------------------------------

	int rows, cols;

	cout << "Введите число строк в массиве: " << endl;
	cin >> rows;

	cout << "Введите число колонок в массиве: " << endl;
	cin >> cols;

	//------создание------------------

	int** arr = new int* [rows];
	for (int i = 0; i < rows; i++)
	{
		arr[i] = new int [cols];
	}

	//---------------заполнение--------

	for (int i = 0; i < rows; i++)
	{
		for (int j = 0; j < cols; j++)
		{
			arr[i][j] = rand() % 10;
		}
	}
	//----------------------------------------------- Вывод--------

	for (int i = 0; i < rows; i++)
	{
		for (int j = 0; j < cols; j++)
		{
			cout << arr[i][j] << "\t";
		}
		cout << endl;
	}

	// --------------подсчет диагонали------------------------------------
	
	int x = 0;
    int j = 0;

	for (int i = 0; i < rows; i++)
	{
			x += arr[i][j];
			j++;
	}

	cout << endl << "Сумма главной диагонали равна:  " << x << endl << endl;

	
	//---------------------------------------------------удаление------------
	for (int i = 0; i < rows; i++)
	{
		delete[] arr[i];   
	}
	delete[] arr;          

	system("pause");

	return 0;
}
